app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // ROLE ADMIN (DEFAULT)
        if (can(['admin'])) {
            /**
             * ============================
             * ROOM COUNTERS
             * ============================
             */

            // Total rooms
            $totalRooms = $this->db->table('tv_devices')
                ->where('deleted_at', null)
                ->countAllResults();

            // Occupied rooms (ACTIVE)
            $occupiedRooms = $this->db->table('guests')
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();

            // Available rooms
            $availableRooms = $totalRooms - $occupiedRooms;

            // Check-in today
            $checkinToday = $this->db->table('guests')
                ->where('DATE(checkin_date)', date('Y-m-d'))
                ->where('deleted_at', null)
                ->countAllResults();

            // Check-out today
            $checkoutToday = $this->db->table('guests')
                ->where('DATE(checkout_date)', date('Y-m-d'))
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();

            // Overdue checkout
            $overdueCheckout = $this->db->table('guests')
                ->where('checkout_date <', date('Y-m-d'))
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tv_devices`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `status` = 'ACTIVE'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE DATE(checkin_date) = '2026-04-13'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE DATE(checkout_date) = '2026-04-13'
AND `status` = 'ACTIVE'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `checkout_date` < '2026-04-13'
AND `status` = 'ACTIVE'
AND `deleted_at` IS NULL

             */

            // Total rooms
            $totalRooms = $this->db->table('tv_devices')
                ->where('deleted_at', null)
                ->countAllResults();

            // Occupied rooms (ACTIVE)
            $occupiedRooms = $this->db->table('guests')
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tv_devices`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `status` = 'ACTIVE'
AND `deleted_at` IS NULL

            $availableRooms = $totalRooms - $occupiedRooms;

            // Check-in today
            $checkinToday = $this->db->table('guests')
                ->where('DATE(checkin_date)', date('Y-m-d'))
                ->where('deleted_at', null)
                ->countAllResults();

            // Check-out today
            $checkoutToday = $this->db->table('guests')
                ->where('DATE(checkout_date)', date('Y-m-d'))
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();

            // Overdue checkout
            $overdueCheckout = $this->db->table('guests')
                ->where('checkout_date <', date('Y-m-d'))
                ->where('status', 'ACTIVE')
                ->where('deleted_at', null)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE DATE(checkin_date) = '2026-01-30'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE DATE(checkout_date) = '2026-01-30'
AND `status` = 'ACTIVE'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `checkout_date` < '2026-01-30'
AND `status` = 'ACTIVE'
AND `deleted_at` IS NULL