app/Controllers/Admin/Guests.php

SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `deleted_at` IS NULL
---
    public function datatable()
    {
        $request = service('request');
        $db      = \Config\Database::connect();
        $builder = $db->table('guests');

        // Soft delete filter
        $builder->where('deleted_at', null);

        $columns = [
            0 => 'guest_name',
            1 => 'device_id',
            2 => 'room_no',
            3 => 'status',
            4 => 'checkin_date',
            5 => 'checkout_date',
            6 => null // action (tidak bisa sort)
        ];

        // Search
        if ($search = $request->getPost('search')['value']) {
            $builder->groupStart()
                ->like('guest_name', $search)
                ->orLike('status', $search)
                ->orLike('device_id', $search)
                ->orLike('room_no', $search)
                ->groupEnd();
        }

        // Total filtered
        $totalFiltered = $builder->countAllResults(false);

SELECT COUNT(*) AS `numrows`
FROM `guests`
WHERE `deleted_at` IS NULL
AND `guests`.`deleted_at` IS NULL
---
        return $this->response->setJSON([
            "draw"            => intval($request->getPost('draw')),
            // "recordsTotal"    => $this->guestModel->countAll(),
            "recordsTotal"    => $this->guestModel->where('deleted_at', null)->countAllResults(),