app/Controllers/Admin/Hkorders.php

    public function index()
    {
        $menus = $this->menu
            ->where('is_active', 1)
            ->where('deleted_at', null)
            ->findAll();
---
SELECT *
FROM `menus`
WHERE `is_active` = 1
AND `deleted_at` IS NULL