app/Controllers/Admin/Orders.php

SELECT *
FROM `menus`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
---
    public function index()
    {
        $menus = $this->menu
            ->where('is_active', 1)
            ->where('deleted_at', null)
            ->findAll();