app/Controllers/Admin/TvDevices.php

SELECT COUNT(*) AS `numrows`
FROM `tv_devices`
WHERE `deleted_at` IS NULL
---
    public function datatable()
    {
        $request = service('request');
        $db      = \Config\Database::connect();
        $builder = $db->table('tv_devices');

        // FILTER SOFT DELETE
        $builder->where('deleted_at', null);

        $columns = [
            0 => 'device_id',
            1 => 'room_no',
            2 => 'id'
        ];

        if ($search = $request->getPost('search')['value']) {
            $builder->groupStart()
                ->like('device_id', $search)
                ->orLike('room_no', $search)
                ->groupEnd();
        }

        // TOTAL FILTERED
        $totalFiltered = $builder->countAllResults(false);