app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
---
    public function attempt()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = (new UserModel())
            ->where('email', $email)
            ->first();